{
    "items": [
        {
            "subreddit": "C_Programming",
            "title": "REVOLUTIONIZE YOUR JOB APPLICATIONS with This AI Tool!",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f8sz90/revolutionize_your_job_applications_with_this_ai/",
            "description": "Hey C Programmers Ever feel overwhelmed by the job application process I stumbled upon an incredible tool called LinkedIn AI Hawk that could change the way you apply for jobs This AI driven bot automates the LinkedIn job application process allowing you to submit tailored CVs and cover letters for..."
        },
        {
            "subreddit": "C_Programming",
            "title": "Safest way to print to the stdout",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f8ss3d/safest_way_to_print_to_the_stdout/",
            "description": "I am currently doing a project in C and was wondering what would be the safest way to print to the stdout I will mainly be dealing with strings I know there are safety issues with printf such as type safety and overflows I am currently using fprintf so if..."
        },
        {
            "subreddit": "C_Programming",
            "title": "White / Black list C program",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f8p523/white_black_list_c_program/",
            "description": "Hell guys i was working on an email validator by C language in order to master the language And i want to add two external source code for the allowed and the non allowed domaine words and address words So how can I engage two external page to do this..."
        },
        {
            "subreddit": "C_Programming",
            "title": "What kind of literature would you recommend to a beginner in C?",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f8ovnz/what_kind_of_literature_would_you_recommend_to_a/",
            "description": "I'm going to start writing in C, what literature can I read first?"
        },
        {
            "subreddit": "C_Programming",
            "title": "Find the size of an array",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f8oh9f/find_the_size_of_an_array/",
            "description": "`void sort(int arr[]) {`\n\n`int length = sizeof(arr)/sizeof(arr[0]);`\n\n`}`\n\n  \nI am using sizeof operator to find the size of an array passed as an argument but an error is coming. Can you please help with this code?"
        },
        {
            "subreddit": "C_Programming",
            "title": "What are best resources to study C (recursion, arrays, pointers, memory allocation) in 4-5 weeks",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f8mi2s/what_are_best_resources_to_study_c_recursion/",
            "description": "My background I have no experience with programming in C at all All I ve done is an entry level college course on Python My situation I am enrolled in a Data Structures and Algorithms course in C that will start in 4 ish weeks I cannot drop the course..."
        },
        {
            "subreddit": "C_Programming",
            "title": "Casting a int pointer to char pointer",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f8i9im/casting_a_int_pointer_to_char_pointer/",
            "description": "I was curious to see what happens when casting a pointer to an integer to a char pointer Here is my input int word 0xDEADBEEF int pword amp word printf Word 0x X n word printf PWord 0x X n pword char pchar char pword printf PChar 0x X n..."
        },
        {
            "subreddit": "C_Programming",
            "title": "Yet Another \"Linker Can't Find Libs\" Post",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f8i3ee/yet_another_linker_cant_find_libs_post/",
            "description": "SOLVED When you include the lib extension on an absolute path it works but if you include it when just including the filename and having the libs directory indicated it doesn t work Don t include the lib guys I think I also remember this and my 25 years of..."
        },
        {
            "subreddit": "C_Programming",
            "title": "How to determine whether a pointer is an element of an array using only standard C?",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f8fbov/how_to_determine_whether_a_pointer_is_an_element/",
            "description": "The solution I currently use works but I recently learned that the standard doesn t actually gurantee that Here s the implementation bool is_elm_within int arr int len int elm uintptr_t begin uintptr_t arr uintptr_t end uintptr_t arr len uintptr_t elm_ uintptr_t elm return elm_ gt begin amp amp elm_..."
        },
        {
            "subreddit": "C_Programming",
            "title": "How to activate auto bracket closing in Dev C++?",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f8d9xs/how_to_activate_auto_bracket_closing_in_dev_c/",
            "description": "Recently started programming C and switch from VSCode to DevC++. My biggest complain is that when I type ( or \\[ or { the brackets don't close automatically. I have to type in the closed bracket after. Didn't like it :("
        },
        {
            "subreddit": "C_Programming",
            "title": "How to Fix This Exe Output File Issue?",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f83rii/how_to_fix_this_exe_output_file_issue/",
            "description": "Recently my exe output files wont open how to fix this My codes are correct and there are no error so i am very clueless about the issue my previous exe output files works perfectly I appreciate all the answers brothers thank you very much in advance https reddit com..."
        },
        {
            "subreddit": "C_Programming",
            "title": "dynamic structures in shared memory - round 2",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f80ird/dynamic_structures_in_shared_memory_round_2/",
            "description": "So two weeks ago I made a thread in here and realized it was too convoluted of an example so I went back to the drawing board and simplified it My goal is to create two programs one that defines a dynamic structure in shared memory and another that attaches..."
        },
        {
            "subreddit": "C_Programming",
            "title": "C3: A Modern Take on C - Exploring the New Kid on the Block.",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7z1h9/c3_a_modern_take_on_c_exploring_the_new_kid_on/",
            "description": "Hey everyone I ve been diving into C3 lately and wanted to share my thoughts and ask for your opinions As a C programmer I m always interested in exploring new languages that build upon the foundations of C while offering modern features C3 seems to be a promising language..."
        },
        {
            "subreddit": "C_Programming",
            "title": "I was hoping some people might be willing to look over and review my \"memory allocator\"",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7ym7c/i_was_hoping_some_people_might_be_willing_to_look/",
            "description": "Hello I ve been working on memory allocator of sorts for dynamic memory in particular basically it uses a fake address space ram or whatever the proper term is i forgor and allows you to malloc to this memory which gives you a fake pointer you can use to read..."
        },
        {
            "subreddit": "C_Programming",
            "title": "Help for writing code guidelines",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7ygqv/help_for_writing_code_guidelines/",
            "description": "Which style F1 F2 F3 better represents or should represent the guidelines of your code Please comment c The function f never returns nullptr int f void F1 int p f if p nullptr assert false return using p void F2 int p f assert p nullptr using p void..."
        },
        {
            "subreddit": "C_Programming",
            "title": "Do you think an in-memory relational database can be faster than C++ STL Map?",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7xu7d/do_you_think_an_inmemory_relational_database_can/",
            "description": "CrossDB is a written in C.\n\nhttps://github.com/crossdb-org/crossdb\n\nBenchmark Test vs. C++ STL Map and HashMap\n\nhttps://crossdb.org/blog/benchmark/crossdb-vs-stlmap/\n\nCrossDB in-memory database performance is between C++ STL Map and HashMap."
        },
        {
            "subreddit": "C_Programming",
            "title": "Does it make sense to write your own operating system kernel right now",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7thp7/does_it_make_sense_to_write_your_own_operating/",
            "description": "I've been learning the C programming language for a few months now, and I've been thinking about writing my own kernel, is there any point in writing one even as practice"
        },
        {
            "subreddit": "C_Programming",
            "title": "I made a random numbers library for cryptography",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7js8z/i_made_a_random_numbers_library_for_cryptography/",
            "description": "Hey guys it s my first time posting here So long story short one day I wondered how Python s Random library generates random numbers and eventually learned about their use in cryptography Ever since I ve been obsessed with random numbers and made a small C library with quite..."
        },
        {
            "subreddit": "C_Programming",
            "title": "reading virtual files from /proc/PID in C program - Linux",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7hnyp/reading_virtual_files_from_procpid_in_c_program/",
            "description": "I m writing a simple program where every process from proc is printed out on the screen and I also want to have the names of each process so I tried file proc 88 status gt it says it s name but when I try to check the file size..."
        },
        {
            "subreddit": "C_Programming",
            "title": "Share your tips and tricks for variable argument functions",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7hk4o/share_your_tips_and_tricks_for_variable_argument/",
            "description": "I basically always use two main variants of variable argument functions: \n- Passing the number of arguments as first parameter\n- Using NULL as terminator \n\nWhat do you prefer? Why?\n\nDo you have some other tips/custom macros you use when dealing with variable argument functions?\n\n"
        },
        {
            "subreddit": "C_Programming",
            "title": "[Project] pack.c - Fast and Efficient File Compression Tool",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7gr56/project_packc_fast_and_efficient_file_compression/",
            "description": "it is a powerful command line utility for file compression and decompression built with efficiency in mind Leveraging the speed of ZSTD pack c delivers high performance compression with no data loss pack c is designed to be both fast and easy to use offering a streamlined command line interface..."
        },
        {
            "subreddit": "C_Programming",
            "title": "[Project] A Lightweight ThreadPool Library for C – Simplify Concurrency in Your C Projects",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7gjs2/project_a_lightweight_threadpool_library_for_c/",
            "description": "I ve been working on a threadpool library for C that aims to make concurrent task management easier and more efficient The library provides a straightforward way to create a pool of threads and schedule tasks with an emphasis on performance and ease of use Highlights Easy thread pool creation..."
        },
        {
            "subreddit": "C_Programming",
            "title": "How to to handle X11 Drag 'n Drop (xDND) events",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7fjj3/how_to_to_handle_x11_drag_n_drop_xdnd_events/",
            "description": "To handle Drag n Drop events with X11 you must use the XDnD protocol Although the XDnD protocol is significantly more complicated than other Drag n Drop APIs it s still relatively simple in theory However implementing it is tedious because it requires properly communicating with the X11 server and..."
        },
        {
            "subreddit": "C_Programming",
            "title": "Badly asked question: Why do malloc/memcpy not violate strict aliasing?",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7faos/badly_asked_question_why_do_mallocmemcpy_not/",
            "description": "gt The effective type of an object for an access to its stored value is the declared type of the object if any If a value is stored into an object having no declared type through an lvalue having a type that is not a non atomic character type then..."
        },
        {
            "subreddit": "C_Programming",
            "title": "Dependency management",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7e1cf/dependency_management/",
            "description": "I was reading Make manual and came across this unholy recipe with automatic prerequisite generation d c set e rm f CC M CPPFLAGS lt gt sed s o 1 o g lt gt rm f While I understood the most of it the question arose why can t we..."
        },
        {
            "subreddit": "C_Programming",
            "title": "How does this union work in the implementation of a phasor in this DSP code?",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f7cwcn/how_does_this_union_work_in_the_implementation_of/",
            "description": "Hello all hobbyist programmer here I was looking through the source for this music programming software Pure Data and was curious as to the purpose of this union I found in their Phasor Class The code is pretty simple I think but I can t quite figure out how this..."
        },
        {
            "subreddit": "C_Programming",
            "title": "Fflatten: A fast png layers flattener with neon intrinsics.",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f791vh/fflatten_a_fast_png_layers_flattener_with_neon/",
            "description": "https github com mnyoshie citest blob master scripts src fflatten c https github com mnyoshie citest blob master scripts src fflatten c This a fast png layers flattener which is written in C plus some neon intrinsics and some portable wrapper for machines that don t have it It performs..."
        },
        {
            "subreddit": "C_Programming",
            "title": "/u/gaiajack's Exquisite Corpse Game: Add your own mechanic to this crowdsourced C/Raylib game on Github",
            "link": "https://github.com/geajack/gdxc",
            "description": ""
        },
        {
            "subreddit": "C_Programming",
            "title": "Are these 2 bit shifting expressions equal?",
            "link": "https://www.reddit.com/r/C_Programming/comments/1f6yqne/are_these_2_bit_shifting_expressions_equal/",
            "description": "I have 2 bit shifting expressions based on the table walking process 1 table_entry amp 1ull lt lt 21 1 amp 1ull lt lt 51 1 2 table_entry amp 1ull lt lt 51 21 1 1 lt lt 21 I noticed that for some table _entry values 1 and 2..."
        },
        {
            "subreddit": "C_Programming",
            "title": "Program that reads recipes from the DOS program Edna's Cook Book",
            "link": "https://github.com/dangarbri/save-edna",
            "description": "Made this to recover recipes I found stored on my family's old DOS computer. Posted the recipes we programmed in at https://dangarbri.tech/recipes"
        }
    ]
}