{
    "items": [
        {
            "subreddit": "golang",
            "title": "hush: Yet Another CLI Password Manager in Go",
            "link": "https://www.reddit.com/r/golang/comments/1f94j20/hush_yet_another_cli_password_manager_in_go/",
            "description": "Hey Gophers I ve developed a CLI password manager called hush using Go and I d really appreciate your feedback and insights Here s a brief overview of what hush does Stores passwords locally with encryption Uses a master password for access Supports adding retrieving and removing passwords Can generate..."
        },
        {
            "subreddit": "golang",
            "title": "Naming idempotent functions",
            "link": "https://www.reddit.com/r/golang/comments/1f92zqy/naming_idempotent_functions/",
            "description": "I've got a function using the cloudflare-go which creates a DNS record, but I'd like to do so idempotently so it's really CreateOrUpdateRecord(), I'm wondering what patterns are common for naming such idempotent functions?"
        },
        {
            "subreddit": "golang",
            "title": "Fibratus 2.2.0 - adversary tradecraft detection, protection, and hunting",
            "link": "https://www.reddit.com/r/golang/comments/1f91uox/fibratus_220_adversary_tradecraft_detection/",
            "description": "This is a long overdue release But for a good reason Fibratus https github com rabbitstack fibratus 2 2 0 marks the start of a new era I worked relentlessly during the past year to reorient the focus towards a security tool capable of adversary tradecraft detection protection and hunting..."
        },
        {
            "subreddit": "golang",
            "title": "build go app for windows 7",
            "link": "https://www.reddit.com/r/golang/comments/1f917q2/build_go_app_for_windows_7/",
            "description": "I know golang doesn't support windows 7 after 1.20, and I looking to way to build my app for windows 7, is there a way to do this if I use golang 1.23"
        },
        {
            "subreddit": "golang",
            "title": "Boxcars, a program for playing backgammon online and offline, is coming soon to Steam",
            "link": "https://store.steampowered.com/app/3182230/Boxcars/",
            "description": ""
        },
        {
            "subreddit": "golang",
            "title": "Golang SaaS / Web app template (Open-Source)",
            "link": "https://www.reddit.com/r/golang/comments/1f8v1vv/golang_saas_web_app_template_opensource/",
            "description": "I built a few internal apps with Golang HTMLX but it s a pain to package everything all the time I m thinking of building a distribution which includes Echo Just for sessions and other useful middleware like CSRF Teams 2 factor auth but will be easily disabled if you..."
        },
        {
            "subreddit": "golang",
            "title": "How do I autogenerate a TS client based on my Go REST routes?",
            "link": "https://www.reddit.com/r/golang/comments/1f8um8y/how_do_i_autogenerate_a_ts_client_based_on_my_go/",
            "description": "Coming from ASP NET I am used to getting my Swagger UI generated automatically for me This allows me to autogenerate a TS client based on the Swagger that s being generated for use in my SPA so I don t have to 1 write the client side API and..."
        },
        {
            "subreddit": "golang",
            "title": "How current do you keep production Go versions?",
            "link": "https://www.reddit.com/r/golang/comments/1f8u8nl/how_current_do_you_keep_production_go_versions/",
            "description": "I m reasonably new with Go and I m wondering what best practices are for maintaining a current version of Go in your production applications I understand that only the past two releases are supported https go dev doc devel release but how big a concern is it if my..."
        },
        {
            "subreddit": "golang",
            "title": "Looking for a web stack that offers decent DX with decent front end interactivity",
            "link": "https://www.reddit.com/r/golang/comments/1f8txy7/looking_for_a_web_stack_that_offers_decent_dx/",
            "description": "TLDR I want to write websites if possible only in go to avoid having two servers saves on server costs but I have no idea about web tech in go in the book Let s Go you use a very simple system with go templates but compared to something like..."
        },
        {
            "subreddit": "golang",
            "title": "Golang research papers",
            "link": "https://www.reddit.com/r/golang/comments/1f8t6vl/golang_research_papers/",
            "description": "I recently stumbled across https://go.dev/wiki/ResearchPapers\nIt stopped 2021. Is there a new page?"
        },
        {
            "subreddit": "golang",
            "title": "Curious on DI opinions - constructor vs parameter",
            "link": "https://www.reddit.com/r/golang/comments/1f8sed2/curious_on_di_opinions_constructor_vs_parameter/",
            "description": "Hello I m curious on the community s opinion on best non framework DI I ve been told by more senior engineers Stat away from setter injection Not sure why But we mainly pass dependencies around via parameters Many of our handlers have messy signatures that rely on many prob..."
        },
        {
            "subreddit": "golang",
            "title": "How to exclude Mocks created using MockGen in your official package GoDocs",
            "link": "https://www.reddit.com/r/golang/comments/1f8roml/how_to_exclude_mocks_created_using_mockgen_in/",
            "description": "I would also like to know .... Is there any way that exported methods defined on unexported fields be shown in GoDoc ?"
        },
        {
            "subreddit": "golang",
            "title": "Decoupling receiving and processing of messages",
            "link": "https://www.reddit.com/r/golang/comments/1f8rn0p/decoupling_receiving_and_processing_of_messages/",
            "description": "I am currently writing a small service where I receive about 100k JSON payloads per day via https There is a lot of information in that payload that is not yet needed Just a few columns But it can be interesting information later so I want to store the payload..."
        },
        {
            "subreddit": "golang",
            "title": "Is VSCode auto imports broken?",
            "link": "https://www.reddit.com/r/golang/comments/1f8oovv/is_vscode_auto_imports_broken/",
            "description": "Hey My VSCode won t suggest and add functions from other packages in my module I have gopls installed and set as the language server in VSCode settings I expected Intellisense to work similar to a Python project where all functions from the project are listed and when selected an..."
        },
        {
            "subreddit": "golang",
            "title": "How Namespaced Cache Keys Improve Service Interoperability",
            "link": "https://medium.com/@pliutau/how-namespaced-cache-keys-improve-service-interoperability-0aada70c33ff",
            "description": ""
        },
        {
            "subreddit": "golang",
            "title": "Ergo Framework 3.0 sets sail today …⛵… ! This is an actor-based framework with network transparency for creating event-driven architecture in Golang. Inspired by Erlang. Zero dependencies.",
            "link": "https://github.com/ergo-services/ergo?tab=readme-ov-file#v300-2024-09-04-tag-version-v1999300",
            "description": ""
        },
        {
            "subreddit": "golang",
            "title": "(Testing) how should we mock remote calls?",
            "link": "https://www.reddit.com/r/golang/comments/1f8jwd8/testing_how_should_we_mock_remote_calls/",
            "description": "Let s say that we have a microservice Normally when we turn on this microservice its web framework will immediately makes many remote calls e g HTTP for a bunch of legitimate reasons to get the latest cloud configuration settings to initialize HTTP clients to establish a socket connection to..."
        },
        {
            "subreddit": "golang",
            "title": "Cannot build code when learning from a book",
            "link": "https://www.reddit.com/r/golang/comments/1f8h5c8/cannot_build_code_when_learning_from_a_book/",
            "description": "I have started studying this book Build an Orchestrator in Go From Scratch After the code on chapter 3 I keep getting errors like this github com docker docker client http github com docker docker client go pkg mod github com docker docker v27 2 0 incompatible client errors go..."
        },
        {
            "subreddit": "golang",
            "title": "handling authorisation in Golang using echo",
            "link": "https://www.reddit.com/r/golang/comments/1f8eush/handling_authorisation_in_golang_using_echo/",
            "description": "I m using echo with templ and htmx to make a basic application I m using oauth using goth for authentication Is it enough for me to store user info like email and id etc in a secure cookie and then have a middleware which extracts this information or is..."
        },
        {
            "subreddit": "golang",
            "title": "Writing new systems from scratch with Temporal",
            "link": "https://www.reddit.com/r/golang/comments/1f8eehe/writing_new_systems_from_scratch_with_temporal/",
            "description": "Let s say you are writing some entirely new software or building an entirely new SaaS and that you ve decided Temporal or similar is going to be part of infrastructure stack from the outset What would you differently How would it affect infrastructure Deployments Architecture How about basic coding..."
        },
        {
            "subreddit": "golang",
            "title": "oapi-codegen strict mode not validating requests",
            "link": "https://www.reddit.com/r/golang/comments/1f8duw0/oapicodegen_strict_mode_not_validating_requests/",
            "description": "The OpenAPI spec includes what is essentially json schema for validating request bodies but it seems like the emitted strict mode server code does not actually do any jsonschema validation e g if the openapi spec says that a request contains a required integer id field and the caller passes..."
        },
        {
            "subreddit": "golang",
            "title": "How to write a logging middleware for net/http?",
            "link": "https://www.reddit.com/r/golang/comments/1f8dt5d/how_to_write_a_logging_middleware_for_nethttp/",
            "description": "Hey everyone Fairly new to Go and decided to use it for a new project to build out the api layer I want to have a logging middleware that logs every request method response status duration etc Using gorilla it was fairly easy using router Use middleware however with the..."
        },
        {
            "subreddit": "golang",
            "title": "SlowSort algorithm",
            "link": "https://www.reddit.com/r/golang/comments/1f892ls/slowsort_algorithm/",
            "description": "You re probably aware of QuickSort algorithm but have you heard about SlowSort p s don t run it in prod package main import fmt sync time func main fmt Println SlowSort int 3 1 2 5 4 1 2 func SlowSort arr int int res int done make chan..."
        },
        {
            "subreddit": "golang",
            "title": "Exploring Goja",
            "link": "https://jtarchie.com/posts/2024-08-30-exploring-goja-a-golang-javascript-runtime",
            "description": ""
        },
        {
            "subreddit": "golang",
            "title": "Application Lifecycle Handling",
            "link": "https://www.reddit.com/r/golang/comments/1f7xl7x/application_lifecycle_handling/",
            "description": "Hello fellow gophers I ve been using this pattern to handle my application lifecycle func main ctx cancel signal NotifyContext context Background os Interrupt perhaps other signals like syscall SIGINT defer cancel var wg sync WaitGroup wg Add 1 go func defer wg Done defer cancel launch something like an..."
        },
        {
            "subreddit": "golang",
            "title": "Image editor in Go?",
            "link": "https://www.reddit.com/r/golang/comments/1f7vnom/image_editor_in_go/",
            "description": "Hey so I ve been toying around with Go for quite a while and made some projects I found interesting like some CLI tools and a backend server I wanted to take it up a notch and try making an image editor with a GUI in Go I m not..."
        },
        {
            "subreddit": "golang",
            "title": "How are you dealing with file generation?",
            "link": "https://www.reddit.com/r/golang/comments/1f7vjvw/how_are_you_dealing_with_file_generation/",
            "description": "Hi It s been about three days since I ve started learning Go and I m pretty impressed with codegen feature but honestly I can t understand how to deal with it in right way Let s say I wanna create a backend project and generate config and db modules..."
        },
        {
            "subreddit": "golang",
            "title": "A short article on the differences between \"Type Alias\" and \"New Types\" in Go",
            "link": "https://perfects.engineering/blog/go_alias_vs_new_types",
            "description": "As a Golang developer, you’ve probably encountered two seemingly similar ways to define types.\n\nI wrote a short article about it. Let me know your thoughts."
        },
        {
            "subreddit": "golang",
            "title": "Deploy rabbitMQ consumer in Golang?",
            "link": "https://www.reddit.com/r/golang/comments/1f7usqv/deploy_rabbitmq_consumer_in_golang/",
            "description": "I have a small Golang program where the producer adds tasks to RabbitMQ and then the consumer consumes them I use https github com panjf2000 ants https github com panjf2000 ants to manage the worker pool for the consumer This leads me to think of the following questions 1 Should..."
        },
        {
            "subreddit": "golang",
            "title": "I can not write a net/Conn example about template programming",
            "link": "https://www.reddit.com/r/golang/comments/1f7tbiv/i_can_not_write_a_netconn_example_about_template/",
            "description": "head payload head payload AType head 1 byte value indicate the payload length BType head 1 byte value indicate the head payload length const AType 1 BType 2 type Conn struct TheType int raw net Conn func slf Conn ReadFramePayload byte error if slf TheType AType var head make byte..."
        }
    ]
}