{
    "items": [
        {
            "subreddit": "golang",
            "title": "choose between rust and go for writing a download manager based on aria2",
            "link": "https://www.reddit.com/r/golang/comments/1f8o5sb/choose_between_rust_and_go_for_writing_a_download/",
            "description": "Hello everyone I hope you are having a good time What is your opinion and which language do you suggest that I do this project I m at a crossroads between choosing Rust and Golang for my new project I m a full stack developer Python JavaScript and have worked..."
        },
        {
            "subreddit": "golang",
            "title": "How Namespaced Cache Keys Improve Service Interoperability",
            "link": "https://medium.com/@pliutau/how-namespaced-cache-keys-improve-service-interoperability-0aada70c33ff",
            "description": ""
        },
        {
            "subreddit": "golang",
            "title": "HTMX gig from upwork",
            "link": "https://www.reddit.com/r/golang/comments/1f8nv27/htmx_gig_from_upwork/",
            "description": "Hello everybody last night I got the gig from upwork where I ve to work with htmx backend is yet to decide Basically I ve to build the knowledge base storing application similar to notion or obsidian It is internal tool so in a month I ve to finish it..."
        },
        {
            "subreddit": "golang",
            "title": "Golang or Typescript",
            "link": "https://www.reddit.com/r/golang/comments/1f8nlce/golang_or_typescript/",
            "description": "Hi Gophers currently I m feeling stuck in pursuing further in my career as junior SWE Background story I m working on the current company which they are going to sunset a PHP project soon Now they want us to focus on Typescript for future project I really like Golang..."
        },
        {
            "subreddit": "golang",
            "title": "Ergo Framework 3.0 sets sail today …⛵… ! This is an actor-based framework with network transparency for creating event-driven architecture in Golang. Inspired by Erlang. Zero dependencies.",
            "link": "https://github.com/ergo-services/ergo?tab=readme-ov-file#v300-2024-09-04-tag-version-v1999300",
            "description": ""
        },
        {
            "subreddit": "golang",
            "title": "(Testing) how should we mock remote calls?",
            "link": "https://www.reddit.com/r/golang/comments/1f8jwd8/testing_how_should_we_mock_remote_calls/",
            "description": "Let s say that we have a microservice Normally when we turn on this microservice its web framework will immediately makes many remote calls e g HTTP for a bunch of legitimate reasons to get the latest cloud configuration settings to initialize HTTP clients to establish a socket connection to..."
        },
        {
            "subreddit": "golang",
            "title": "Cannot build code when learning from a book",
            "link": "https://www.reddit.com/r/golang/comments/1f8h5c8/cannot_build_code_when_learning_from_a_book/",
            "description": "I have started studying this book Build an Orchestrator in Go From Scratch After the code on chapter 3 I keep getting errors like this github com docker docker client http github com docker docker client go pkg mod github com docker docker v27 2 0 incompatible client errors go..."
        },
        {
            "subreddit": "golang",
            "title": "handling authorisation in Golang using echo",
            "link": "https://www.reddit.com/r/golang/comments/1f8eush/handling_authorisation_in_golang_using_echo/",
            "description": "I m using echo with templ and htmx to make a basic application I m using oauth using goth for authentication Is it enough for me to store user info like email and id etc in a secure cookie and then have a middleware which extracts this information or is..."
        },
        {
            "subreddit": "golang",
            "title": "Writing new systems from scratch with Temporal",
            "link": "https://www.reddit.com/r/golang/comments/1f8eehe/writing_new_systems_from_scratch_with_temporal/",
            "description": "Let s say you are writing some entirely new software or building an entirely new SaaS and that you ve decided Temporal or similar is going to be part of infrastructure stack from the outset What would you differently How would it affect infrastructure Deployments Architecture How about basic coding..."
        },
        {
            "subreddit": "golang",
            "title": "oapi-codegen strict mode not validating requests",
            "link": "https://www.reddit.com/r/golang/comments/1f8duw0/oapicodegen_strict_mode_not_validating_requests/",
            "description": "The OpenAPI spec includes what is essentially json schema for validating request bodies but it seems like the emitted strict mode server code does not actually do any jsonschema validation e g if the openapi spec says that a request contains a required integer id field and the caller passes..."
        },
        {
            "subreddit": "golang",
            "title": "How to write a logging middleware for net/http?",
            "link": "https://www.reddit.com/r/golang/comments/1f8dt5d/how_to_write_a_logging_middleware_for_nethttp/",
            "description": "Hey everyone Fairly new to Go and decided to use it for a new project to build out the api layer I want to have a logging middleware that logs every request method response status duration etc Using gorilla it was fairly easy using router Use middleware however with the..."
        },
        {
            "subreddit": "golang",
            "title": "SlowSort algorithm",
            "link": "https://www.reddit.com/r/golang/comments/1f892ls/slowsort_algorithm/",
            "description": "You re probably aware of QuickSort algorithm but have you heard about SlowSort p s don t run it in prod package main import fmt sync time func main fmt Println SlowSort int 3 1 2 5 4 1 2 func SlowSort arr int int res int done make chan..."
        },
        {
            "subreddit": "golang",
            "title": "Exploring Goja",
            "link": "https://jtarchie.com/posts/2024-08-30-exploring-goja-a-golang-javascript-runtime",
            "description": ""
        },
        {
            "subreddit": "golang",
            "title": "Application Lifecycle Handling",
            "link": "https://www.reddit.com/r/golang/comments/1f7xl7x/application_lifecycle_handling/",
            "description": "Hello fellow gophers I ve been using this pattern to handle my application lifecycle func main ctx cancel signal NotifyContext context Background os Interrupt perhaps other signals like syscall SIGINT defer cancel var wg sync WaitGroup wg Add 1 go func defer wg Done defer cancel launch something like an..."
        },
        {
            "subreddit": "golang",
            "title": "Image editor in Go?",
            "link": "https://www.reddit.com/r/golang/comments/1f7vnom/image_editor_in_go/",
            "description": "Hey so I ve been toying around with Go for quite a while and made some projects I found interesting like some CLI tools and a backend server I wanted to take it up a notch and try making an image editor with a GUI in Go I m not..."
        },
        {
            "subreddit": "golang",
            "title": "How are you dealing with file generation?",
            "link": "https://www.reddit.com/r/golang/comments/1f7vjvw/how_are_you_dealing_with_file_generation/",
            "description": "Hi It s been about three days since I ve started learning Go and I m pretty impressed with codegen feature but honestly I can t understand how to deal with it in right way Let s say I wanna create a backend project and generate config and db modules..."
        },
        {
            "subreddit": "golang",
            "title": "A short article on the differences between \"Type Alias\" and \"New Types\" in Go",
            "link": "https://perfects.engineering/blog/go_alias_vs_new_types",
            "description": "As a Golang developer, you’ve probably encountered two seemingly similar ways to define types.\n\nI wrote a short article about it. Let me know your thoughts."
        },
        {
            "subreddit": "golang",
            "title": "Deploy rabbitMQ consumer in Golang?",
            "link": "https://www.reddit.com/r/golang/comments/1f7usqv/deploy_rabbitmq_consumer_in_golang/",
            "description": "I have a small Golang program where the producer adds tasks to RabbitMQ and then the consumer consumes them I use https github com panjf2000 ants https github com panjf2000 ants to manage the worker pool for the consumer This leads me to think of the following questions 1 Should..."
        },
        {
            "subreddit": "golang",
            "title": "I can not write a net/Conn example about template programming",
            "link": "https://www.reddit.com/r/golang/comments/1f7tbiv/i_can_not_write_a_netconn_example_about_template/",
            "description": "head payload head payload AType head 1 byte value indicate the payload length BType head 1 byte value indicate the head payload length const AType 1 BType 2 type Conn struct TheType int raw net Conn func slf Conn ReadFramePayload byte error if slf TheType AType var head make byte..."
        },
        {
            "subreddit": "golang",
            "title": "Testing in Golang - a crash article to get you going",
            "link": "https://thedevelopercafe.com/articles/testing-in-go-929e2ad2",
            "description": ""
        },
        {
            "subreddit": "golang",
            "title": "Cellular Automata terminal simulator in Go`",
            "link": "https://www.youtube.com/shorts/NTaHi1l9XZg",
            "description": ""
        },
        {
            "subreddit": "golang",
            "title": "seq - A Go Iterator Module",
            "link": "https://www.reddit.com/r/golang/comments/1f7f6vh/seq_a_go_iterator_module/",
            "description": "seq https pkg go dev github com GodsBoss g seq is a module that builds upon the iterators introduced in Go 1 23 https go dev doc go1 23 Provides the usual suspects like Filter Map or Reduce but also some more interesting mechanisms like throttling or cancellation Comes with..."
        },
        {
            "subreddit": "golang",
            "title": "pdfcpu rolling on..",
            "link": "https://www.reddit.com/r/golang/comments/1f7etfg/pdfcpu_rolling_on/",
            "description": "pdfcpu v0 8 1 is out PDF 2 0 encryption Improved CJK support Extended annotation support Check out countless samples https github com pdfcpu pdfcpu tree master pkg samples https github com pdfcpu pdfcpu tree master pkg samples Check it out https github com pdfcpu pdfcpu releases tag v0 8..."
        },
        {
            "subreddit": "golang",
            "title": "iteration filter for Go 1.23",
            "link": "https://www.reddit.com/r/golang/comments/1f7d9pq/iteration_filter_for_go_123/",
            "description": "You can create filtered iter Seq iter Seq2 It will filter execution of yields given in for range The implementation side processes of iter Seq are not filtered tingtt iterutil github com https github com tingtt iterutil tingtt iterutil pkg go dev https pkg go dev github com tingtt iterutil..."
        },
        {
            "subreddit": "golang",
            "title": "Struggling to Understand Go 1.23 Iterators: How Does the Loop Work?",
            "link": "https://www.reddit.com/r/golang/comments/1f7d89d/struggling_to_understand_go_123_iterators_how/",
            "description": "I have been trying to understand the concept of iterators introduced in the new Go 1 23 release but I m struggling to comprehend how the iteration call happens multiple times and where the boolean value for stopping the loop is obtained Here s my code snippet for reference package..."
        },
        {
            "subreddit": "golang",
            "title": "Is wails.io used by big tech? ",
            "link": "https://www.reddit.com/r/golang/comments/1f7994u/is_wailsio_used_by_big_tech/",
            "description": "I'm trying wails, it's great! Which companies use it?"
        },
        {
            "subreddit": "golang",
            "title": "go build from debug produces wrong codesigned binary",
            "link": "https://www.reddit.com/r/golang/comments/1f78qjw/go_build_from_debug_produces_wrong_codesigned/",
            "description": "This is kind of a random issue if I change a few lines around maybe it ll start working or not Basically here is what happens go build o __debug_bin288148591 gcflags all N l __debug_bin288148591 zsh killed __debug_bin288148591 Then the binary is removed If I remove l it seems to..."
        },
        {
            "subreddit": "golang",
            "title": "A simple, no-install blogging platform 😭",
            "link": "https://tunalog.org/en-us/index.html",
            "description": ""
        },
        {
            "subreddit": "golang",
            "title": "Looking for some mentor help in unit testing",
            "link": "https://www.reddit.com/r/golang/comments/1f771kc/looking_for_some_mentor_help_in_unit_testing/",
            "description": "Hi,\n\nI am a beginner in Golang. I am struggling to write unit testing code and achieve code coverage. I need some mentor help on this. Please let me know if anyone who can help me on this."
        },
        {
            "subreddit": "golang",
            "title": "GopherCon Korea 2024",
            "link": "https://www.reddit.com/r/golang/comments/1f735b0/gophercon_korea_2024/",
            "description": "Greetings I m part of the team organizing GopherCon Korea 2024 and I m excited to share details about our upcoming conference with you GopherCon Korea 2024 Announcement The annual GopherCon Korea event the largest Go language community gathering in Korea is back again Whether you re a beginner intermediate..."
        }
    ]
}