{
    "items": [
        {
            "subreddit": "rust",
            "title": "choose between rust and go for writing a download manager based on aria2",
            "link": "https://www.reddit.com/r/rust/comments/1f8o50x/choose_between_rust_and_go_for_writing_a_download/",
            "description": "I m at a crossroads between choosing Rust and Golang for my new project I m a full stack developer Python JavaScript and have worked on a few projects with C and Java as well I want to expand my skills so I m planning to start a new project..."
        },
        {
            "subreddit": "rust",
            "title": "this code is so terrible🤦‍♂️. it's in the crossterm crate, who let this through?",
            "link": "https://www.reddit.com/r/rust/comments/1f8o07t/this_code_is_so_terrible_its_in_the_crossterm/",
            "description": "rust let str match self Color Reset gt reset Color Black gt black Color DarkGrey gt dark_grey Color Red gt red Color DarkRed gt dark_red Color Green gt green Color DarkGreen gt dark_green Color Yellow gt yellow Color DarkYellow gt dark_yellow Color Blue gt blue Color DarkBlue gt dark_blue Color..."
        },
        {
            "subreddit": "rust",
            "title": "Is there a way to build tauri application and use whisperx?",
            "link": "https://www.reddit.com/r/rust/comments/1f8nyu2/is_there_a_way_to_build_tauri_application_and_use/",
            "description": "I was creating a tuari application which would locally record the mic and speaker Is there anyway we can have integration with WhisperX https github com m bain whisperX or something like this for transcription as well locally The quality of transcription of whisperx and diarization is extremely good Or..."
        },
        {
            "subreddit": "rust",
            "title": "A little distraction for you: XOR operator and other AI Assistants considerations",
            "link": "https://bufferunderrun.net/posts/2024/quiz-1-xor-operator-and-llms/",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Read from stdin with timeout.",
            "link": "https://www.reddit.com/r/rust/comments/1f8n3g3/read_from_stdin_with_timeout/",
            "description": "Hello everyone I am in a bit of a pickle I want to read a line from stdin with a timeout of 30 seconds I can do it with Tokio but I was wondering if there is a lighter simpler way to to it For clarity I want to do..."
        },
        {
            "subreddit": "rust",
            "title": "This Month in Rust OSDev: August 2024",
            "link": "https://rust-osdev.com/this-month/2024-08/",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "What are future feature of the rust programming language?",
            "link": "https://www.reddit.com/r/rust/comments/1f8lqz8/what_are_future_feature_of_the_rust_programming/",
            "description": "By future feature i means the most impactful feature that will exist"
        },
        {
            "subreddit": "rust",
            "title": "Should accessibility be baked in to TUI libraries/apps?",
            "link": "https://www.reddit.com/r/rust/comments/1f8jwln/should_accessibility_be_baked_in_to_tui/",
            "description": "I ask because I don’t know if people who need screen readers would use TUI apps much. I don’t know anything about how visually impaired people use tech though\n\n[View Poll](https://www.reddit.com/poll/1f8jwln)"
        },
        {
            "subreddit": "rust",
            "title": "The Rust Programming Language Book chapter 8 exercise critique",
            "link": "https://www.reddit.com/r/rust/comments/1f8ger7/the_rust_programming_language_book_chapter_8/",
            "description": "I wrote a program in Rust after reading Chapter 8 in the Rust Programming Language book This is the final exercise developing a program that takes user input and adds a department an employee or both to a company If you want to see it in my github see my..."
        },
        {
            "subreddit": "rust",
            "title": "Added orcs and some new game mechanics, everything written in Rust. Only first few minutes worth watching, if anything.",
            "link": "https://youtu.be/PMoX2CBtHPc",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Struggeling with modularizing cli tool",
            "link": "https://www.reddit.com/r/rust/comments/1f8arxb/struggeling_with_modularizing_cli_tool/",
            "description": "Hy there I ve written a CLI tool and most of the code is in main rs I have red the rust book and multiple threads blogs about how to modularize but I m still struggeling The tool has multiple commands and subcommands e g profile clone quick mass Intuitively..."
        },
        {
            "subreddit": "rust",
            "title": "Has Rust 1.8.0 broken anyone else's builds?",
            "link": "https://www.reddit.com/r/rust/comments/1f88s0h/has_rust_180_broken_anyone_elses_builds/",
            "description": "This is the first time for me a new version broke one of the sub packages I relied on Heard there was controversy with this release didn t expect it to really break my small program This was the error I got Rust 1 8 breaking time package https preview..."
        },
        {
            "subreddit": "rust",
            "title": "memory leak nightmare",
            "link": "https://www.reddit.com/r/rust/comments/1f87uf0/memory_leak_nightmare/",
            "description": "Hey everyone I ve been running this project screenpipe https github com mediar ai screenpipe locally for about 24 hours and it ended up using 300 GB of memory This issue has been persisting for weeks and I haven t been able to find a solution Could someone please take..."
        },
        {
            "subreddit": "rust",
            "title": "An Optimization That's Impossible in Rust!",
            "link": "https://www.reddit.com/r/rust/comments/1f87siw/an_optimization_thats_impossible_in_rust/",
            "description": "Article https tunglevo com note an optimization thats impossible in rust https tunglevo com note an optimization thats impossible in rust The other day I came across an article about German string a short string optimization claiming this kind of optimization is impossible in Rust Puzzled by the statement given..."
        },
        {
            "subreddit": "rust",
            "title": "Rust (code) in documentation with Typst",
            "link": "https://www.reddit.com/r/rust/comments/1f86qe3/rust_code_in_documentation_with_typst/",
            "description": "Early evaluation of Typst https github com typst typst suggests that we should use Typst as documentation markup language it is faaaast and easy crossplatform for a new coming 2025 project that is starting from scratch What is the community suggested best package to highlight Rust code in Typst How..."
        },
        {
            "subreddit": "rust",
            "title": "Seeking feedback for my first rust project ",
            "link": "https://www.reddit.com/r/rust/comments/1f86j2d/seeking_feedback_for_my_first_rust_project/",
            "description": "Hi I m coming from Go and recently decided to learn rust to expand my stack and knowledge As my first project as I do in every language I made a simple snake game using raylib Since rust has so many new design patterns I tried my best to use..."
        },
        {
            "subreddit": "rust",
            "title": "Treehole application built with Leptos",
            "link": "https://taglinq.com/about",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "How to participate rust free contribution?",
            "link": "https://www.reddit.com/r/rust/comments/1f85oxs/how_to_participate_rust_free_contribution/",
            "description": "Hi all I always want to contribute to some programming community However I don t know where to start due to my background I m a physicist PhD 5 years experience on c and python to program some computational physics code for academia Unsurprisingly we only need something that only..."
        },
        {
            "subreddit": "rust",
            "title": "My first Rust project: a Node-RED run-time engine prototype",
            "link": "https://www.reddit.com/r/rust/comments/1f85fxw/my_first_rust_project_a_nodered_runtime_engine/",
            "description": "Hello people As a project to practice learning Rust I ve created or maybe you could say borrowed heavily from an open source run time engine prototype that s compatible with Node RED in Rust It can directly run flows json workflow files generated by Node RED If you haven..."
        },
        {
            "subreddit": "rust",
            "title": "Send polymorphic Box&lt;dyn T&gt;",
            "link": "https://www.reddit.com/r/rust/comments/1f854p7/send_polymorphic_boxdyn_t/",
            "description": "Is it possible to use Box lt dyn T gt in a Send polymorphic way I have a struct struct Container t Box lt dyn T gt I want to use Container both when T is Send so that Container is Send and not where it s not I could..."
        },
        {
            "subreddit": "rust",
            "title": "Rust Firebird Client updated to v0.25 with a few features and fixes",
            "link": "https://cms.firebirdsql.org/en/community-news/rust-firebird-client-updated-to-v0-25-with-a-few-features-and-fixes",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Rust adventure to develop a Game Boy emulator - Intro",
            "link": "https://medium.com/@wolferxy/rust-adventure-to-develop-a-game-boy-emulator-838646ee3a31",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Is this trait sealed, or not sealed — that is the question",
            "link": "https://predr.ag/blog/is-this-trait-sealed-or-not-sealed/",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Done with The Book and Rustlings, what next?",
            "link": "https://www.reddit.com/r/rust/comments/1f82l41/done_with_the_book_and_rustlings_what_next/",
            "description": "Hello I am a machine learning researcher with knowledge of Python my main instrument C and C who has decided to learn Rust I don t have immediate use for Rust but want to have it in my toolbox I had read and mostly understood The Book after which I..."
        },
        {
            "subreddit": "rust",
            "title": "[Media] This weird error shows up whenever I open a rust file in neovim(it uses rust-analyzer) but there is no error shown when I run `cargo check`",
            "link": "https://i.redd.it/4ndt2wt9wlmd1.png",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "gccrs August 2024 monthly report",
            "link": "https://rust-gcc.github.io/2024/09/03/2024-08-monthly-report.html",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Nutype 0.5.0: the newtype with guarantees supports custom errors",
            "link": "https://www.reddit.com/r/rust/comments/1f81d2v/nutype_050_the_newtype_with_guarantees_supports/",
            "description": "Release notes https github com greyblake nutype releases tag v0 5 0 https github com greyblake nutype releases tag v0 5 0 README https github com greyblake nutype https github com greyblake nutype What is nutype Nutype is a proc macro that adds sanitization and validation to newtypes ensuring values..."
        },
        {
            "subreddit": "rust",
            "title": "The allegations are true... I've been rewriting a Grammar checker in Rust",
            "link": "https://www.reddit.com/r/rust/comments/1f8159z/the_allegations_are_true_ive_been_rewriting_a/",
            "description": "A couple months ago I started to get really fed up with the existing grammar checkers for Neovim The two kingpins of the space LanguageTool and Grammarly would both take multiple seconds to scan my work for errors which I consider atrocious for something that should be relatively straightforward I..."
        },
        {
            "subreddit": "rust",
            "title": "Learning Rust for fun and backdoo-rs",
            "link": "https://security.humanativaspa.it/learning-rust-for-fun-and-backdoo-rs/",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Published my first crate and looking for feedback",
            "link": "https://www.reddit.com/r/rust/comments/1f7zb1z/published_my_first_crate_and_looking_for_feedback/",
            "description": "I started out working on an aviation related project where I downloaded the FAA s airspace definition files which are these 600 column wide fixed width monstrosities of text files The libraries I found for parsing fixed width files all had runtime defined data structures that needed to be defined..."
        }
    ]
}