{
    "items": [
        {
            "subreddit": "rust",
            "title": "Recommend Beginner level rust project ",
            "link": "https://www.reddit.com/r/rust/comments/1f92git/recommend_beginner_level_rust_project/",
            "description": "I am doing rust for almost a month and can code small projects easily now I want to start a beginner level project so can anyone recommend me which project will be good in learning and understanding concepts "
        },
        {
            "subreddit": "rust",
            "title": "Bevy’s community issues and the state of the project",
            "link": "https://www.reddit.com/r/rust/comments/1f92122/bevys_community_issues_and_the_state_of_the/",
            "description": "apologies but this post turned out longer than I expected however these issues have been brewing for awhile and there s significant context that needs to be addressed First of all I m not saying bevy is a bad project from a technical perspective Bevy is actually pretty interesting and..."
        },
        {
            "subreddit": "rust",
            "title": "Async Rust can be a pleasure to work with (without `Send + Sync + 'static`)",
            "link": "https://emschwartz.me/async-rust-can-be-a-pleasure-to-work-with-without-send-sync-static",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Call for Proposals: Full-Time Open Source Rust Maintainer",
            "link": "https://www.reddit.com/r/rust/comments/1f90yjh/call_for_proposals_fulltime_open_source_rust/",
            "description": "A Rust developer into bitcoin and want to help maintain some awesome crates Apply for a BDK Open Source Rust Maintainer Grant The BDK Foundation is seeking proposals for a full time Rust maintainer to support the ongoing development and maintenance of the BDK suite of open source software All..."
        },
        {
            "subreddit": "rust",
            "title": "No logging in release builds?",
            "link": "https://www.reddit.com/r/rust/comments/1f90c2v/no_logging_in_release_builds/",
            "description": "I m building an app that uses the log crate and simple_logger crate to log So my app works just as expected in debug builds All the log output is printed to the console I use Windows But when I do cargo run release nothing is logged not matted what..."
        },
        {
            "subreddit": "rust",
            "title": "This Month in Redox OS - August 2024",
            "link": "https://www.redox-os.org/news/this-month-240831/",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Geo-AID v0.5.0 released along with a new gradient descent optimization engine (still looking for contributors)",
            "link": "https://github.com/Geo-AID/Geo-AID",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "OpenMLS 0.6 released",
            "link": "https://www.reddit.com/r/rust/comments/1f8xoig/openmls_06_released/",
            "description": "I m happy to announce the release of OpenMLS v0 6 a significant update to our open source MLS implementation This version includes several new features and improvements Read all details on the blog https blog openmls tech posts 2024 09 04 v0 _6 release https blog openmls tech posts..."
        },
        {
            "subreddit": "rust",
            "title": "Announcing tagged-id",
            "link": "https://www.reddit.com/r/rust/comments/1f8xoef/announcing_taggedid/",
            "description": "Hey there I just released a Rust port of a pattern we use internally at work in our Haskell code base The idea is pretty simple in backend services that need to interface with multiple APIs and databases instead of using raw IDs all over the place you can use..."
        },
        {
            "subreddit": "rust",
            "title": "Deploying Rust in Existing Firmware Codebases",
            "link": "https://security.googleblog.com/2024/09/deploying-rust-in-existing-firmware.html",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "iroh 0.24.0 - Upgrading to Quinn 11",
            "link": "https://www.iroh.computer/blog/iroh-0-24-0-quinn-11",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Security advisory for the standard library (CVE-2024-43402) | Rust Blog",
            "link": "https://blog.rust-lang.org/2024/09/04/cve-2024-43402.html",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Firefox will consider a Rust implementation of JPEG-XL",
            "link": "https://github.com/mozilla/standards-positions/pull/1064",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "aws dynamodb simple helper crate",
            "link": "https://crates.io/crates/aws-dynamo-derive",
            "description": "Hi folks I wrote a very simple helper procedual macro crate to simply using aws sdk dynamodb https docs rs aws sdk dynamodb latest aws_sdk_dynamodb I have been working with dynamodb gathering data as the time flows and found the library is a bit verbose to use In order to..."
        },
        {
            "subreddit": "rust",
            "title": "Roast my in-memory- auth token cache",
            "link": "https://www.reddit.com/r/rust/comments/1f8us5u/roast_my_inmemory_auth_token_cache/",
            "description": "I m writing a generic in memory cache to store reusable auth tokens The goal is to use this in an axum application that needs to make authenticated calls to external API s The requirements that I set out for myself are 1 Tokens are fetched lazily i e only..."
        },
        {
            "subreddit": "rust",
            "title": "Box: sandboxed development container manager",
            "link": "https://www.reddit.com/r/rust/comments/1f8tpib/box_sandboxed_development_container_manager/",
            "description": "Hello i thought i would share a project i ve been working on quite some time a container manager like distrobox but sandboxed by default The project originally started as an experiment using shell scripts and later on i started using it to develop itself I updated it whenever i..."
        },
        {
            "subreddit": "rust",
            "title": "Curious about x86-64 codegen with `relocation-model=pic`",
            "link": "https://www.reddit.com/r/rust/comments/1f8stkz/curious_about_x8664_codegen_with/",
            "description": "I ve been looking at the generated code for a simple function call and when relocation model pic and the same function is called twice the function calls are done indirectly via a register after loading the function address This doesn t happen for C using Clang What s the..."
        },
        {
            "subreddit": "rust",
            "title": "I want to do many projects but I don't know where to start",
            "link": "https://www.reddit.com/r/rust/comments/1f8rklj/i_want_to_do_many_projects_but_i_dont_know_where/",
            "description": "There are many projects that I am curious about but I don't know how they work and how to do them in practice and theory and I have no idea where to start learning.\n\nExample: I want to create my own project:\n\nCode Editor, Database, Programming language, etc..."
        },
        {
            "subreddit": "rust",
            "title": "How do I implement the same trait for FnMuts with different signatures?\n",
            "link": "https://www.reddit.com/r/rust/comments/1f8qcen/how_do_i_implement_the_same_trait_for_fnmuts_with/",
            "description": "rust trait A impl lt F gt A for F where F FnMut i32 impl lt F gt A for F where F FnMut i64 Prompt conflict implementation rust 19 impl lt F gt A for F where F FnMut i32 first implementation here 20 impl lt F gt A..."
        },
        {
            "subreddit": "rust",
            "title": "Mecano. A typing test",
            "link": "https://www.reddit.com/r/rust/comments/1f8q0xw/mecano_a_typing_test/",
            "description": "Preview of the game https i redd it 9nqc0dd2trmd1 gif This is a minimalist TUI typing test I developed myself in Rust I was inspired by other tests like monkeytype and 10fastfingers but I wanted something you could use on the terminal with no internet connection I am working as..."
        },
        {
            "subreddit": "rust",
            "title": "What do Rustaceans think about the gen keyword?",
            "link": "https://www.reddit.com/r/rust/comments/1f8plus/what_do_rustaceans_think_about_the_gen_keyword/",
            "description": "I personally think its a feature that Rust lacked until now, and will prove to be very useful in future crates."
        },
        {
            "subreddit": "rust",
            "title": "choose between rust and go for writing a download manager based on aria2",
            "link": "https://www.reddit.com/r/rust/comments/1f8o50x/choose_between_rust_and_go_for_writing_a_download/",
            "description": "I m at a crossroads between choosing Rust and Golang for my new project I m a full stack developer Python JavaScript and have worked on a few projects with C and Java as well I want to expand my skills so I m planning to start a new project..."
        },
        {
            "subreddit": "rust",
            "title": "Is there a way to build tauri application and use whisperx?",
            "link": "https://www.reddit.com/r/rust/comments/1f8nyu2/is_there_a_way_to_build_tauri_application_and_use/",
            "description": "I was creating a tuari application which would locally record the mic and speaker Is there anyway we can have integration with WhisperX https github com m bain whisperX or something like this for transcription as well locally The quality of transcription of whisperx and diarization is extremely good Or..."
        },
        {
            "subreddit": "rust",
            "title": "A little distraction for you: XOR operator and other AI Assistants considerations",
            "link": "https://bufferunderrun.net/posts/2024/quiz-1-xor-operator-and-llms/",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Read from stdin with timeout.",
            "link": "https://www.reddit.com/r/rust/comments/1f8n3g3/read_from_stdin_with_timeout/",
            "description": "Hello everyone I am in a bit of a pickle I want to read a line from stdin with a timeout of 30 seconds I can do it with Tokio but I was wondering if there is a lighter simpler way to to it For clarity I want to do..."
        },
        {
            "subreddit": "rust",
            "title": "This Month in Rust OSDev: August 2024",
            "link": "https://rust-osdev.com/this-month/2024-08/",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "What are future feature of the rust programming language?",
            "link": "https://www.reddit.com/r/rust/comments/1f8lqz8/what_are_future_feature_of_the_rust_programming/",
            "description": "By future feature i means the most impactful feature that will exist"
        },
        {
            "subreddit": "rust",
            "title": "The Rust Programming Language Book chapter 8 exercise critique",
            "link": "https://www.reddit.com/r/rust/comments/1f8ger7/the_rust_programming_language_book_chapter_8/",
            "description": "I wrote a program in Rust after reading Chapter 8 in the Rust Programming Language book This is the final exercise developing a program that takes user input and adds a department an employee or both to a company If you want to see it in my github see my..."
        },
        {
            "subreddit": "rust",
            "title": "Added orcs and some new game mechanics, everything written in Rust. Only first few minutes worth watching, if anything.",
            "link": "https://youtu.be/PMoX2CBtHPc",
            "description": ""
        },
        {
            "subreddit": "rust",
            "title": "Struggeling with modularizing cli tool",
            "link": "https://www.reddit.com/r/rust/comments/1f8arxb/struggeling_with_modularizing_cli_tool/",
            "description": "Hy there I ve written a CLI tool and most of the code is in main rs I have red the rust book and multiple threads blogs about how to modularize but I m still struggeling The tool has multiple commands and subcommands e g profile clone quick mass Intuitively..."
        }
    ]
}